0003-xnvme-part-1/xnvme-compare.output
# fio xnvme-compare.fio --section=null
null: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=null, iodepth=1
fio-3.30-63-g66087
Starting 1 thread
Jobs: 1 (f=1): [r(1)][100.0%][r=24.4GiB/s][r=6387k IOPS][eta 00m:00s]
null: (groupid=0, jobs=1): err= 0: pid=127619: Sat Jun 25 02:08:42 2022
  read: IOPS=6367k, BW=24.3GiB/s (26.1GB/s)(1457GiB/60000msec)
    clat (nsec): min=10, max=17789, avg=20.62, stdev= 6.51
     lat (nsec): min=39, max=17809, avg=46.44, stdev=10.22
    clat percentiles (nsec):
     |  1.00th=[   20],  5.00th=[   20], 10.00th=[   20], 20.00th=[   20],
     | 30.00th=[   20], 40.00th=[   20], 50.00th=[   20], 60.00th=[   20],
     | 70.00th=[   20], 80.00th=[   20], 90.00th=[   20], 95.00th=[   30],
     | 99.00th=[   30], 99.50th=[   30], 99.90th=[   30], 99.95th=[   30],
     | 99.99th=[   40]
   bw (  MiB/s): min=24509, max=24960, per=100.00%, avg=24877.23, stdev=63.87, samples=119
   iops        : min=6274368, max=6389956, avg=6368570.72, stdev=16351.32, samples=119
  lat (nsec)   : 20=0.03%, 50=99.96%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=99.99%, sys=0.00%, ctx=6259, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=382013595,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=24.3GiB/s (26.1GB/s), 24.3GiB/s-24.3GiB/s (26.1GB/s-26.1GB/s), io=1457GiB (1565GB), run=60000-60000msec

# fio xnvme-compare.fio --section=xnvme_nil
xnvme_nil: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
fio-3.30-63-g66087
Starting 1 thread
Jobs: 1 (f=1): [r(1)][100.0%][r=18.9GiB/s][r=4952k IOPS][eta 00m:00s]
xnvme_nil: (groupid=0, jobs=1): err= 0: pid=127590: Sat Jun 25 02:07:34 2022
  read: IOPS=4919k, BW=18.8GiB/s (20.1GB/s)(1126GiB/60000msec)
    slat (nsec): min=29, max=15860, avg=41.41, stdev= 8.62
    clat (nsec): min=29, max=17050, avg=40.57, stdev= 7.79
     lat (nsec): min=69, max=17150, avg=81.98, stdev=11.45
    clat percentiles (nsec):
     |  1.00th=[   30],  5.00th=[   40], 10.00th=[   40], 20.00th=[   40],
     | 30.00th=[   40], 40.00th=[   40], 50.00th=[   40], 60.00th=[   40],
     | 70.00th=[   40], 80.00th=[   40], 90.00th=[   40], 95.00th=[   50],
     | 99.00th=[   50], 99.50th=[   50], 99.90th=[   50], 99.95th=[   50],
     | 99.99th=[   80]
   bw (  MiB/s): min=19017, max=19366, per=100.00%, avg=19217.21, stdev=137.86, samples=119
   iops        : min=4868572, max=4957812, avg=4919606.40, stdev=35292.94, samples=119
  lat (nsec)   : 50=93.28%, 100=6.72%, 250=0.01%, 500=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=99.99%, sys=0.00%, ctx=6021, majf=0, minf=0
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=295110185,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=18.8GiB/s (20.1GB/s), 18.8GiB/s-18.8GiB/s (20.1GB/s-20.1GB/s), io=1126GiB (1209GB), run=60000-60000msec

# fio xnvme-compare.fio --section=io_uring
io_uring: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=io_uring, iodepth=1
fio-3.30-63-g66087
Starting 1 thread
Jobs: 1 (f=1): [r(1)][100.0%][r=430MiB/s][r=110k IOPS][eta 00m:00s]
io_uring: (groupid=0, jobs=1): err= 0: pid=128055: Sat Jun 25 02:12:03 2022
  read: IOPS=110k, BW=429MiB/s (450MB/s)(25.2GiB/60001msec)
    slat (nsec): min=960, max=24380, avg=1042.14, stdev=87.30
    clat (nsec): min=90, max=286185, avg=7834.91, stdev=611.09
     lat (nsec): min=7860, max=287265, avg=8877.05, stdev=617.77
    clat percentiles (nsec):
     |  1.00th=[ 7648],  5.00th=[ 7712], 10.00th=[ 7712], 20.00th=[ 7712],
     | 30.00th=[ 7712], 40.00th=[ 7776], 50.00th=[ 7776], 60.00th=[ 7776],
     | 70.00th=[ 7776], 80.00th=[ 7776], 90.00th=[ 7840], 95.00th=[ 8032],
     | 99.00th=[ 8896], 99.50th=[12736], 99.90th=[15680], 99.95th=[15936],
     | 99.99th=[17792]
   bw (  KiB/s): min=437304, max=441808, per=100.00%, avg=440118.72, stdev=547.43, samples=119
   iops        : min=109326, max=110452, avg=110029.71, stdev=136.90, samples=119
  lat (nsec)   : 100=0.01%, 250=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=99.20%, 20=0.80%, 50=0.01%
  lat (usec)   : 100=0.01%, 500=0.01%
  cpu          : usr=6.47%, sys=23.45%, ctx=6597128, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6597087,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=429MiB/s (450MB/s), 429MiB/s-429MiB/s (450MB/s-450MB/s), io=25.2GiB (27.0GB), run=60001-60001msec

Disk stats (read/write):
  nvme0n1: ios=6585979/0, merge=0/0, ticks=45768/0, in_queue=45767, util=99.91%

# fio xnvme-compare.fio --section=xnvme_io_uring
xnvme_io_uring: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=xnvme, iodepth=1
fio-3.30-63-g66087
Starting 1 thread
Jobs: 1 (f=1): [r(1)][100.0%][r=425MiB/s][r=109k IOPS][eta 00m:00s]
xnvme_io_uring: (groupid=0, jobs=1): err= 0: pid=128024: Sat Jun 25 02:10:54 2022
  read: IOPS=109k, BW=425MiB/s (445MB/s)(24.9GiB/60001msec)
    slat (nsec): min=1090, max=18679, avg=1153.46, stdev=54.36
    clat (nsec): min=120, max=79599, avg=7829.95, stdev=662.44
     lat (nsec): min=8260, max=80838, avg=8983.41, stdev=666.40
    clat percentiles (nsec):
     |  1.00th=[ 7648],  5.00th=[ 7712], 10.00th=[ 7712], 20.00th=[ 7712],
     | 30.00th=[ 7712], 40.00th=[ 7712], 50.00th=[ 7776], 60.00th=[ 7776],
     | 70.00th=[ 7776], 80.00th=[ 7776], 90.00th=[ 7840], 95.00th=[ 7968],
     | 99.00th=[ 9024], 99.50th=[12736], 99.90th=[15808], 99.95th=[16192],
     | 99.99th=[27264]
   bw (  KiB/s): min=433312, max=436360, per=100.00%, avg=435000.87, stdev=661.76, samples=119
   iops        : min=108328, max=109090, avg=108750.22, stdev=165.45, samples=119
  lat (nsec)   : 250=0.01%
  lat (usec)   : 4=0.01%, 10=99.17%, 20=0.80%, 50=0.02%, 100=0.01%
  cpu          : usr=8.27%, sys=23.32%, ctx=6521126, majf=0, minf=1
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6520948,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=425MiB/s (445MB/s), 425MiB/s-425MiB/s (445MB/s-445MB/s), io=24.9GiB (26.7GB), run=60001-60001msec
`